routes/web.php

*/

Route::get('/', function () {
    return view('users',[
        'users' => User::all()
    ]);
---
SELECT * FROM "users"


Route::get('/users/{user}', function ($id) {

    return view('user',[
        'user' =>  User::find($id),
        'liquidAccounts' => User::find($id)->liquidAccounts,
        'investmentAccounts' => User::find($id)->investmentAccounts,

    ]);
});

Route::get('/users', function () {
    return view('users',[
        'users' => User::all()
    ]);
});
---
SELECT * FROM "investment_accounts" WHERE "investment_accounts"."user_id" = 4 and "investment_accounts"."user_id" IS not NULL
SELECT * FROM "liquid_accounts" WHERE "liquid_accounts"."user_id" = 4 and "liquid_accounts"."user_id" IS not NULL
SELECT * FROM "users" WHERE "users"."id" = '4' LIMIT 1
SELECT * FROM "users"